brew "jq"  # command-line JSON processor
brew "git"
brew "fzf"  # fuzzy text/file search tool
brew "wget"  # download content from internet
brew "tldr"  # cheat-sheet references for CLI tools/commands 
brew "tmux"  # terminal multiplexer
brew "tree"  # tree viewer for directories
brew "stow"  # symlinking tool
brew "pyenv"

# Enhancements
brew "gping"  # 'ping' command with a graph display
brew "lsd"  # better version of ls
brew "ctop"  # htop for docker containers
brew "dysk"  # better, colorized version of 'df'
brew "zsh-syntax-highlighting"  # color highlighting for terminal

cask "iterm2"
